Assignement/Lab02-incompFlows/combustorSimpleBlown/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc	residuals(p,U,k,epsilon)
	
	force
	{
		type		forces;
		enabled		yes;
		libs		("libforces.so");
		log		yes;
		patches		(splitter back fuel_inlet);
		rho		rhoInf;
		rhoInf		1.18;

		writeControl	writeTime;
		writeInterval	1;

		liftDir		(1 0 0);
		dragDir		(0 1 0);
		CofR		(0 0 0);
	}
	
	pInlet
	{
		type		surfaceFieldValue;
		enabled		yes;
		log		true;
				
		writeControl	writeTime;
		writeInterval	1;

		regionType	patch;
		writeFields	no;
		name		inlet;
		operation	average;
		fields		(p);

		libs		("libfieldFunctionObjects.so");
	}
	yPlus
	{    
		// Mandatory entries (unmodifiable)
   		type            yPlus;
    		libs            ("libfieldFunctionObjects.so");

    		// Optional (inherited) entries
    		writePrecision  6;
    		writeToFile     false;
    		enabled         true;
    		log             false;
   		timeStart       0;
    		timeEnd         1000;
    		writeControl    writeTime;
    		writeInterval   1;
}
